answer_examples = [
    {
        "input": "가명정보를 파기한 경우 관련 기록을 얼마동안 보관해야 하나요?", 
        "answer": """개인정보보호법 제28조의4(가명정보에 대한 안전조치의무 등)에 따르면, 가명정보를 파기한 경우 관련 기록은 파기한 날부터 3년 이상 보관해야 합니다. 이는 가명정보의 안전한 처리를 위해 필요한 조치입니다."""
    },
    {
        "input": "개인정보를 국외이전할 때 정보주체에게 알려야 하는 사항은 무엇인가요?", 
        "answer": """
개인정보보호법 제28조의8(개인정보의 국외 이전)에 따르면 개인정보를 국외로 이전할 때 정보주체에게 알려야 하는 사항은 다음과 같습니다:
1. 이전되는 개인정보 항목
2. 개인정보가 이전되는 국가, 시기 및 방법
3. 개인정보를 이전받는 자의 성명(법인인 경우에는 그 명칭과 연락처를 말한다)
4. 개인정보를 이전받는 자의 개인정보 이용목적 및 보유ㆍ이용 기간
5. 개인정보의 이전을 거부하는 방법, 절차 및 거부의 효과
"""
    },
]